#include "libs/lib_route/route.h"
#include <iostream>
#include <climits>

using namespace std;

int main(){
    int n1, n2;
    cin >> n1;
    cin >> n2;

    int data1[5][5] = {
    {0,3,1,3,4},
    {5,0,3,2,4},
    {4,4,0,2,4},
    {4,8,2,0,4},
    {2,8,7,1,0}
    };


    int data2[15][15] = {
    {  0, 29, 82, 46, 68, 52, 72, 42, 51, 55, 29, 74, 23, 72, 46 },  // 0
    { 29,  0, 55, 46, 42, 43, 43, 23, 23, 31, 41, 51, 11, 52, 21 },  // 1
    { 82, 55,  0, 68, 46, 55, 23, 43, 41, 29, 79, 21, 64, 31, 51 },  // 2
    { 46, 46, 68,  0, 82, 15, 72, 31, 62, 42, 21, 51, 51, 43, 64 },  // 3
    { 68, 42, 46, 82,  0, 74, 23, 52, 21, 46, 82, 58, 46, 65, 23 },  // 4
    { 52, 43, 55, 15, 74,  0, 61, 23, 55, 31, 33, 37, 51, 29, 59 },  // 5
    { 72, 43, 23, 72, 23, 61,  0, 42, 23, 31, 77, 37, 51, 46, 33 },  // 6
    { 42, 23, 43, 31, 52, 23, 42,  0, 33, 15, 37, 33, 33, 31, 37 },  // 7
    { 51, 23, 41, 62, 21, 55, 23, 33,  0, 29, 62, 46, 29, 51, 11 },  // 8
    { 55, 31, 29, 42, 46, 31, 31, 15, 29,  0, 51, 21, 41, 23, 37 },  // 9
    { 29, 41, 79, 21, 82, 33, 77, 37, 62, 51,  0, 65, 42, 59, 61 },  // 10
    { 74, 51, 21, 51, 58, 37, 37, 33, 46, 21, 65,  0, 61, 11, 55 },  // 11
    { 23, 11, 64, 51, 46, 51, 51, 33, 29, 41, 42, 61,  0, 62, 23 },  // 12
    { 72, 52, 31, 43, 65, 29, 46, 31, 51, 23, 59, 11, 62,  0, 59 },  // 13
    { 46, 21, 51, 64, 23, 59, 33, 37, 11, 37, 61, 55, 23, 59,  0 }
    };  
    cout << "----------------Реализация первого массива 5X5 с полным перебором и эвристикой----------------"<<endl;
    for(int i = 0; i < n1; i++){
        for(int j = 0; j < n1; j++){
            cout << data1[i][j] << " ";
        }
        cout << endl;
    }

    int** matr1 = new int*[n1];
    for(int i = 0; i < n1; i++) {
        matr1[i] = new int[n1];
        for(int j = 0; j < n1; j++) {
            matr1[i][j] = data1[i][j];
        }
    }
    Route x{n1};
    int min = INT_MAX, len;
    while(x[0] <= 0){
        len = x.routePrice(matr1);
        cout << x << "Длина пути: " << len;
        if(min > len){
            min = len;
            cout << "\t<--current min"<<endl; 
        }
        else{
            cout << endl;
        }
        x.nextRoute();
    }
    
    cout<<"Эвристика"<<endl;
    int len1 = x.greedySearch(matr1);
    cout << x << "Длина пути по эвристике: " << len1 << endl;
    cout << endl;

    cout << "----------------Реализация второго массива 15X15 с эвристикой и первым путем----------------"<<endl;
    for(int i = 0; i < n2; i++){
        for(int j = 0; j < n2; j++){
            cout << data2[i][j] << " ";
        }
        cout << endl;
    }

    int** matr2 = new int*[n2];
    for(int i = 0; i < n2; i++) {
        matr2[i] = new int[n2];
        for(int j = 0; j < n2; j++) {
            matr2[i][j] = data2[i][j];
        }
    }
    Route y{x}, z{n2};
    y = z;
    y.greedySearch(matr2);
    cout << y << "Длина пути по эвристике: " << y.routePrice(matr2) << endl;
    cout << z << "Длина первого пути: " << z.routePrice(matr2) << endl;


    for(int i = 0; i< n2; i++){
        delete[] matr2[i];
    }
    delete[] matr2;

    for(int i = 0; i< n1; i++){
        delete[] matr1[i];
    }
    delete[] matr1;


    return 0;
}